taalabash/ASH-DJ-Controller/hardware/custom/avr/boards.txt
unorestore.name=UNO 16U2 Restore Firmware
unorestore.bootloader.tool=arduino:avrdude
unorestore.bootloader.low_fuses=0xff
unorestore.bootloader.high_fuses=0xd9
unorestore.bootloader.extended_fuses=0xf4
unorestore.bootloader.file=Arduino-COMBINED-dfu-usbserial-atmega16u2-Uno-Rev3.hex
unorestore.bootloader.unlock_bits=0x3F
unorestore.bootloader.lock_bits=0x0F
unorestore.build.mcu=atmega16u2
unorestore.build.f_cpu=16000000L
unorestore.build.board=uno.build.board=AVR_UNO
unorestore.build.core=arduino:arduino
unorestore.build.variant=standard


megarestore.name=MEGA2560 16U2 Restore Firmware
megarestore.bootloader.tool=arduino:avrdude
megarestore.bootloader.low_fuses=0xff
megarestore.bootloader.high_fuses=0xd9
megarestore.bootloader.extended_fuses=0xf4
megarestore.bootloader.file=Arduino-COMBINED-dfu-usbserial-atmega16u2-Mega2560-Rev3.hex
megarestore.bootloader.unlock_bits=0x3F
megarestore.bootloader.lock_bits=0x0F
megarestore.build.mcu=atmega16u2
megarestore.build.f_cpu=16000000L
megarestore.build.board=uno.build.board=AVR_MEGA2560
megarestore.build.core=arduino:arduino
megarestore.build.variant=standard


unomocolufa.name=UNO 16U2 moco lufa dual mode
unomocolufa.bootloader.tool=arduino:avrdude
unomocolufa.bootloader.low_fuses=0xff
unomocolufa.bootloader.high_fuses=0xd9
unomocolufa.bootloader.extended_fuses=0xf4
unomocolufa.bootloader.file=UNO-dual-moco-lufa.hex
unomocolufa.bootloader.unlock_bits=0x3F
unomocolufa.bootloader.lock_bits=0x0F
unomocolufa.build.mcu=atmega16u2
unomocolufa.build.f_cpu=16000000L
unomocolufa.build.board=uno.build.board=AVR_UNO
unomocolufa.build.core=arduino:arduino
unomocolufa.build.variant=standard


megamocolufa.name=MEGA 2560 16U2 moco lufa dual mode
megamocolufa.bootloader.tool=arduino:avrdude
megamocolufa.bootloader.low_fuses=0xff
megamocolufa.bootloader.high_fuses=0xd9
megamocolufa.bootloader.extended_fuses=0xf4
megamocolufa.bootloader.file=MEGA2560-dual-moco-lufa.hex
megamocolufa.bootloader.unlock_bits=0x3F
megamocolufa.bootloader.lock_bits=0x0F
megamocolufa.build.mcu=atmega16u2
megamocolufa.build.f_cpu=16000000L
megamocolufa.build.board=uno.build.board=AVR_MEGA2560
megamocolufa.build.core=arduino:arduino
megamocolufa.build.variant=standard